{
  "items":
  [
    {
      "name": "Dr. Marvin Berman",
      "modalId": "berman",
      "text": "Dr. Marvin Berman has been a pediatric dentist for more than four decades. He serves on the Council of Dental Practice and is a Consumer Advisor for the American Dental Association as well as a spokesman for the American Academy of Pediatric Dentistry. He is a renowned Lecturer and shares his expertise at dental meetings throughout the world. He has published numerous articles and his instructional videotapes are part of the curriculum of many dental schools. Music and theater are his other passions but he's particularly proud of his wife Joyce and their four children and seven grandchildren. Dr. Berman is grateful for the professional and personal relationship he has nurtured with Dr. Kollmann and Dr. Furusho."
    },
    {
      "name": "Deneaqua Brown",
      "modalId": "deneaqua",
      "text": "Deneaqua (Nicky), an important part of Dentistry for Kids for the last 9 years is a qualified expanded function dental assistant having successfully completed her certification in coronal polishing and sealant placement. She has 4 children…Lakyhia, Raymond, Lajarius and Aujulay and her grandchild…Deontae. In her spare time Nicky enjoys cooking, hair styling and spending time with her family."
    },
    {
      "name": "Letticia Chavez",
      "modalId": "letticia",
      "text": "Hello! I’d like to introduce myself - I’m Letticia, but you can call me Letty, one of the newest team members here at Dentistry for Kids. I am excited to be part of this awesome team! I have a 5 year-old son, Isaiah. We love to watch movies together and summer time is our favorite season. In my spare time I enjoy football, basketball, swimming and sand volleyball with my friends. I am looking forward to meeting everyone and getting to know your children!"
    },
    {
      "name": "Cassidy Johnson",
      "modalId": "cassidy",
      "text": "Hello! I'm Cassidy and I have been a part of the Dentistry for Kids team since 2012! I'm am excited and ecstatic to be working with such a fantastic and friendly team. I attended Gordon Tech and graduated from Evanston Township High School. In my spare time I like to spend time with my family and friends. I enjoy watching, playing and attending all Chicago sports games. I also enjoy cooking, shopping and traveling. My latest adventure is Peru and hiking Machu Picchu. I’m looking forward to seeing our patients and parents everyday!"
    },
    {
      "name": "Marisela Paz",
      "modalId": "marisela",
      "text": "Marisela, our office manager, is celebrating 19 years with Dentistry For Kids and she is the person that makes certain that the office operates as smoothly as possible. Mari is happily married to her husband, Mike and they are proud of their children Bianca and Isaac. The family enjoys biking, riding, movies and spending time with their dog . . . Libby. Marisela volunteers at her children’s schools and is actively involved with the Juvenile Diabetes Research Foundation"
    },
    {
      "name": "Adam Ramirez",
      "modalId": "adam",
      "text": "Adam, is one of the lead dental assistants at Dentistry for KIds. He received his dental assistant degree from Triton College and continued on to receive his certification in coronal polishing and sealant placement. Adam is happily married. He is a Chicago native and loves showing his son and wife the best the city has to offer. The love Adam has for his family transfers over to his gentle and kind nature when working with our patients. He is bilingual in Spanish and English. Adam’s birthday is on Halloween so come celebrate with him and don’t forget your costume!"
    },
    {
      "name": "Tanisha Blanch",
      "modalId": "tanisha",
      "text": "Hello! My name is Tanisha and I am the newest member of the Dentistry for Kids team. I am a city girl - I graduated from Carl Schurz High School and have lived in Chicago my whole life. I have always worked with children of all ages from 3 to 18. My goal is to one day become a dental hygienist. I am looking forward to getting to know your children! In my spare time I love spending time with my family. Happy Smiles!"
    },
    {
      "name": "Michael Cruz",
      "modalId": "michael",
      "text": "Michael is an enthusiastic member of our team. He graduated from Everest College with his dental assisting degree. He continued his education and received his coronal polishing and sealant certificate. Michael is very tall and may seem intimidating but from the moment you meet him you will realize he is just a gentle giant. He enjoys interacting with the kids because it brings out the inner child in him. He has been helping care for his nieces and nephews since they were infants. In his free time he spends time with his family and enjoys basketball and working out. Ask him about his favorite sport - he has so many!"
    }
  ]
}